// VS Code 相關

// language 語言
// 在 F1 輸入 Configure display language 修改

// configure 設置

// preferences 偏愛、偏好

// settings 設置、設定

// installed 安裝過去式、已安裝

// uninstall 解安裝

// user snippets 用戶片段，將特定的代碼設置成快捷鍵
// file -> preferences -> User Snippets -> 選需要的
// 如果 Snippets 的 body 內有需要列出已被使用的符號，使用 \ 符號轉譯，例如 "\$"

// example 範例

// file 文件

// terminal 終端機(命令)

// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------

// CSS 相關

// display 顯示

// path 路徑

// nav 導航

// italic 斜體

// active 當前選擇的

// container 容器

// content 內容

// warp 無法翻譯, 類似限制容器寬高的字, 可以設置在 main class

// item 項目

// title 標題

// text 文字

// number 數字

// pic 圖片

// before 之前
// after 之後

// striped 有條紋的

// border 邊框

// rectangle 矩形

// circle 圓形

// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------

// javascript 相關

// property 屬性
// attribute 屬性

// comment 註解

// deprecated 已經棄用

// removed 已經刪除

// driven 驅動
// event driven 事件驅動
// observer 觀察者
// pub / sub
// 將 A 與 B 中間設置仲介者，避免 A 與 B 直接接觸，通常用於解耦合

// handler 處理器, 事件函式後綴名稱

// controls 控制項

// container 容器, css class 後綴名稱

// Promise 承諾
// resolve 解決，工作完成
// reject 拒絕，工作失敗
// result 結果
// sync 同步
// async 異步
// await 等待

// request 要求
// response 反應，回應

// calc 計算

// increment 增量

// area 面積

// flag 旗，用於開關

// gender 性別

// global 全局

// compiling 編譯

// error 錯誤

// template 模板

// methods 方法

// invalid 失敗，無效

// expression 表達式

// keywords 關鍵字

// info 訊息

// instance 實體、實例

// reference 引用、參考

// login 登入

// register 註冊

// utils 函式庫

// toggle 切換

// answer 回答、答案

// direction 方向

// operate 操作

// direct 直接的, 形參名稱

// inside 裡面

// outside 外面

// default 默認

// redirect 重新導向

// coupling 耦合

// inject 注入, 注射

// single 單一個

// odd 奇數

// even 偶數

// done 完畢

// payload 有效載荷, 有效內容, 有效資料

// status 地位, 狀態

// card 卡片

// list 列表

// item 項, 複數項目中的一個

// slider 滑動

// total 全部, 總和

// count 計數, 數數

// change 改變

// flip 翻動, 翻頁

// unit 單位, 單元

// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
